app/controllers/docentes_controller.rb

  def index
    @docentes = Docente.all
---
SELECT "docentes".* FROM "docentes"

  def create
    @docente = Docente.new(docente_params)

    respond_to do |format|
      if @docente.save
---
INSERT INTO "docentes" ("nombre", "ci", "apellidopaterno", "apellidomaterno", "whatsapp", "telefonofijo", "area", "sexo", "nacionalidad", "profesion", "acercade", "referencias", "titulo", "lugardenacimiento", "estadocivil", "foto", "observaciones", "fechaingreso", "modalidadcontrato", "fechafinalizacion", "lunes", "martes", "miercoles", "jueves", "viernes", "sabado", "domingo", "horariodetrabajo", "formadepago", "nombrebanco", "cuentabancaria", "facebook", "skype", "twitter", "linkedin", "medioatencion", "faseCRM", "urlcurriculum", "urlcontrato", "estado", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @docente.destroy
---
DELETE FROM "docentes" WHERE "docentes"."id" = ?  [["id", 4]]

    def set_docente
      @docente = Docente.find(params[:id])
---
SELECT  "docentes".* FROM "docentes" WHERE "docentes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]