app/controllers/participantes_controller.rb

SELECT "participantes".* FROM "participantes"
---
  def index
    @participantes = Participante.all

INSERT INTO "participantes" ("ci", "nombre", "apellidoP", "apellidoM", "numWpp", "numFijo", "direccion", "fecNacimiento", "latitud", "longitud", "nit", "empresa", "teloficina", "rubro", "email", "cargo", "sexo", "nacionalidad", "professor", "categoria", "ciudad", "pais", "sitioweb", "facebook", "skype", "twitter", "linkedin", "medioatecion", "faseCRM", "responsable", "observaciones", "password", "estado", "foto", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @participante = Participante.new(participante_params)

    respond_to do |format|
      if @participante.save

DELETE FROM "participantes" WHERE "participantes"."id" = ?  [["id", 2]]
---
  def destroy
    @participante.destroy

SELECT  "participantes".* FROM "participantes" WHERE "participantes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_participante
      @participante = Participante.find(params[:id])